#——————————面向对象（oop）————————————#
# python所有的数据类型都属于对象类型
# 对象就是一个实例化的类，而类就是拥有同一类特性（属性和行为）的对象。比如人都拥有名字、年龄身高···会吃会跑会跳等等。。。
# 然后具体到某一个人比如名字叫什么，年龄身高多少。
# 也就是类没有确定的值，而对象却有
###————————————————————#
# 面向过程和面向对象的区别（做饭洗碗为例子）
# 1、面向过程
# ——》你-》洗菜——倒油·····——擦干
# 2、面向对象
# ——》你——（这里就是先实例化一个对象）——》对象——（做饭技能1（具体的功能以及属性）+洗碗技能2）
#
# ——》你——（这里就是先实例化一个对象）——》对象（子类）——（做饭技能1——》自动炒菜机（父类）+洗碗技能2——》自动洗碗机（父类对象））


#——————————#
# 面向对象就是对面向过程的封装

# 把面向过程是所使用的属性以及方法封装为一个类，然后再使用时传入具体的属性实例化一个类（也就是一个对象）

# 面向过程最最要的是分析问题——》划分任务——》分解步骤
#
#
# 面向对象的是——划分对象——》确定每个对象的任务以及功能


#————————————#
# 过度——》把（面向过程）所做的具体步骤
#                                          ||
#                                          ▽
# ——》试图分离实现步骤中的功能代码块——》把功能代码块划分到一个具体对象——》根据对象抽象出对应的类——》设计类
